{
  "_name_or_path": "KPF/KPF-bert-ner",
  "adam_epsilon": 1e-08,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "batch_size": 32,
  "classifier_dropout": null,
  "device": "cuda",
  "epoch": 30,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "PAD",
    "1": "UNK",
    "2": "O",
    "3": "B-\uc0c1\ud638",
    "4": "I-\uc0c1\ud638"
  },
  "initializer_range": 0.02,
  "intermediate_hidden_size": 768,
  "intermediate_size": 3072,
  "label2id": {
    "B-\uc0c1\ud638": 3,
    "I-\uc0c1\ud638": 4,
    "O": 2,
    "PAD": 0,
    "UNK": 1
  },
  "layer_norm_eps": 1e-12,
  "learning_rate": 0.005,
  "max_grad_norm": 1.0,
  "max_position_embeddings": 512,
  "max_seq_len": 120,
  "model_name": "kpfbert",
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "seed": 1000,
  "test_data": "21_150tags_EntityLinking",
  "torch_dtype": "float32",
  "train_data": "21_150tags_EntityLinking",
  "transformers_version": "4.38.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 36440
}
